src/Books Review/The C Programming Language/Answers to Exercises.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: Answers to Exercises
#+OPTIONS: num:nil


http://users.powernet.co.uk/eton/kandr2/index.html
http://daybreakcx.is-programmer.com/posts/15303.html

K&R Exercise 1-21 - Mental incomprehension
http://stackoverflow.com/questions/3020031/kr-exercise-1-21-mental-incomprehension

http://clc-wiki.net/wiki/K%26R2_solutions

On C Programming and K & R’s Impossible Exercise 1-21
http://dgoodmaniii.wordpress.com/2009/11/22/on-c-programming-and-k-rs-impossible-exercise-1-21/

http://compgroups.net/comp.lang.c/k-r-exercise-1-21-entab/378393
