public_html/Books Review/The C Programming Language/Answers to Exercises.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Answers to Exercises</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Answers to Exercises"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-10T22:36+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Answers to Exercises</h1>


<p>
<a href="http://users.powernet.co.uk/eton/kandr2/index.html">http://users.powernet.co.uk/eton/kandr2/index.html</a>
<a href="http://daybreakcx.is-programmer.com/posts/15303.html">http://daybreakcx.is-programmer.com/posts/15303.html</a>
</p>
<p>
K&amp;R Exercise 1-21 - Mental incomprehension
<a href="http://stackoverflow.com/questions/3020031/kr-exercise-1-21-mental-incomprehension">http://stackoverflow.com/questions/3020031/kr-exercise-1-21-mental-incomprehension</a>
</p>
<p>
<a href="http://clc-wiki.net/wiki/K&amp;R2_solutions">http://clc-wiki.net/wiki/K%26R2_solutions</a>
</p>
<p>
On C Programming and K &amp; R’s Impossible Exercise 1-21
<a href="http://dgoodmaniii.wordpress.com/2009/11/22/on-c-programming-and-k-rs-impossible-exercise-1-21/">http://dgoodmaniii.wordpress.com/2009/11/22/on-c-programming-and-k-rs-impossible-exercise-1-21/</a>
</p>
<p>
<a href="http://compgroups.net/comp.lang.c/k-r-exercise-1-21-entab/378393">http://compgroups.net/comp.lang.c/k-r-exercise-1-21-entab/378393</a>
</p></div>

<div id="postamble">
<p class="date">Date: 2013-05-10T22:36+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
